Revit 2016 API
PromptForFamilyInstancePlacementOptions Properties
The PromptForFamilyInstancePlacementOptions type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
PlaceAirTerminalOnDuct
 If true, when placing an air terminal, the terminal will be placed directly on the duct without fittings. If fase, the terminal will be placed with generated fittings.
See Also
PromptForFamilyInstancePlacementOptions Class
Autodesk.Revit.UI Namespace